// Задача 1
// Дан следующий массив:
//let arr = {'a', 'b', 'c'};
//Дана также переменная key со значением 2.
//Выведите на экран элемент, ключ которого хранится в переменной key.

let arr = ['a', 'b', 'c'];
let key = 2;
console.log(arr[key]);
alert(arr[key]);

// Задача 2
// Дан следующий массив:
// let arr = [1, 2, 3, 4, 5];
// Дана также переменная key1 со значением 1 и переменная key2 со значением 2.
// Найдите сумму элементов, ключи которых хранятся в наших переменных.

let arr = [1, 2, 3, 4, 5];
let key1 = 1;
let key2 = 2;
let sum = arr[key1] + arr[key2];
console.log(sum);

