// Задача 1
// Не подсматривая в учебник перечислите все примитивные типы данных в JavaScript.

string, number, boolean, null, uderfined, symbol, bigInt

// Задача 2
// Не запуская код, определите, что выведется на экран в консоль:

console.log( typeof {a: 1, b: 2, c: 3} ); // object

// Задача 3
// Не запуская код, определите, что выведется на экран в консоль:

console.log( typeof [1, 2, 3] ); // object

// Задача 4
// Не запуская код, определите, что выведется на экран в консоль:

let arr = [1, 2, 3];
console.log( typeof arr ); // object

// Задача 5
// Не запуская код, определите, что выведется на экран в консоль:

let arr = [1, 2, 3];
console.log( typeof arr[0] ); // number

// Задача 6
// Не запуская код, определите, что выведется на экран в консоль:

let arr = ['1', '2', '3'];
console.log( typeof arr[0] ); // string

// Задача 7
// Не запуская код, определите, что выведется на экран в консоль:

console.log( Array.isArray([1, 2, 3]) ); // true

// Задача 8
// Не запуская код, определите, что выведется на экран в консоль:

console.log( Array.isArray({a: 1, b: 2, c: 3}) ); // false
