// Задача 1
// Не запуская код, определите, что выведется на экран:

let num = 1;
num = num + 1;
num = num + 1;

alert(num); // 3

// Задача 2
// Не запуская код, определите, что выведется на экран:

let num = 1;
num = num + 2;
num = num + 3;

alert(num); // 6

// Задача 3
// Переделайте этот код так, чтобы в нем использовались описанные сокращенные операции:

let num = 47;
num = num + 7; // num += 7;
num = num - 18; // num -= 18;
num = num * 10; // num *= 10;
num = num / 15; // num /= 15;
alert(num);
