// Задача 1
// Если переменная test больше 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 10;
if (test > 10) {
  alert('верно');
} else {
  alert('неверно');
}
// Задача 2
// Если переменная test меньше 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 10;
if (test < 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 3
// Если переменная test больше или равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 9;
if (test >= 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 4
// Если переменная test меньше или равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 9;
if (test <= 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 5
// Если переменная test равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 9;
if (test == 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 6
// Если переменная test не равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 9;
if (test != 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 7
// Даны переменные test1 и test2. Проверьте, что значение какой из этих переменных больше и выведите соответствующее сообщение на экран.

let test1 = 1;
let test2 = 5;
if (test1 > test2) {
  alert(`${test1} > ${test2}`);
} else {
  alert(`${test2} > ${test1}`);
}
