// Задача 1
// Переделайте этот код так, чтобы в нем операции инкремента и декремента:

let num = 10;
num = num + 1; // num++
num = num + 1; // num++
num = num - 1; // num--
alert(num);

// Задача 2
// Не запуская код, определите, что выведется на экран:

let num = 3;
alert(++num); // 4

// Задача 3
// Не запуская код, определите, что выведется на экран:

let num = 3;
alert(num++); // 3

// Задача 4
// Не запуская код, определите, что выведется на экран:

let num = 3;
alert(--num); // 2

// Задача 5
// Не запуская код, определите, что выведется на экран:

let num = 3;
alert(num--); // 3

// Задача 6
// Не запуская код, определите, что выведется на экран:

let num1 = 3;
let num2 = ++num1;
alert(num1); // 4
alert(num2); // 4

// Задача 7
// Не запуская код, определите, что выведется на экран:

let num1 = 3;
let num2 = num1++;
alert(num1); // 4
alert(num2); // 3

// Задача 8
// Не запуская код, определите, что выведется на экран:

let num1 = 3;
let num2 = --num1;
alert(num1); // 2
alert(num2); // 2

// Задача 9
// Не запуская код, определите, что выведется на экран:

let num1 = 3;
let num2 = num1--;
alert(num1); // 2
alert(num2); // 3

// Задача 10
// Не запуская код, определите, что выведется на экран:

let num1 = 3;
num1++;
let num2 = num1--;
alert(num1++); // 4
alert(--num2); // 3
