// Задача 1
// Не запуская код, определите, что выведется на экран:

let test1 = '3';
let test2 = '3';

if (test1 == test2) {
	alert('верно'); // именно такой будет результат
} else {
	alert('неверно');
}

// Задача 2
// Не запуская код, определите, что выведется на экран:

let test1 = '3';
let test2 = '3';

if (test1 === test2) {
	alert('верно'); // именно такой будет результат
} else {
	alert('неверно');
}

// Задача 3
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = '3';

if (test1 == test2) {
	alert('верно'); // именно такой будет результат
} else {
	alert('неверно');
}

// Задача 4
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = '3';

if (test1 === test2) {
	alert('верно');
} else {
	alert('неверно'); // именно такой будет результат
}

// Задача 5
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = 3;

if (test1 === test2) {
	alert('верно'); // именно такой будет результат
} else {
	alert('неверно');
}

// Задача 6
// Не запуская код, определите, что выведется на экран:

let test1 = '3';
let test2 = '3';

if (test1 != test2) {
	alert('верно');
} else {
	alert('неверно'); // именно такой будет результат
}

// Задача 7
// Не запуская код, определите, что выведется на экран:

let test1 = '3';
let test2 = '3';

if (test1 !== test2) {
	alert('верно');
} else {
	alert('неверно'); // именно такой будет результат
}

// Задача 8
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = '3';

if (test1 != test2) {
	alert('верно');
} else {
	alert('неверно'); // именно такой будет результат
}

// Задача 9
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = '3';

if (test1 !== test2) {
	alert('верно'); // именно такой будет результат
} else {
	alert('неверно');
}

// Задача 10
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = 2;

if (test1 !== test2) {
	alert('верно'); // именно такой будет результат
} else {
	alert('неверно');
}
