// Задача 1
// С помощью цикла for выведите в консоль числа от 1 до 100.

for (let i = 1; i <= 100; i++) {
  console.log(i);
}

// Задача 2
// С помощью цикла for выведите в консоль числа от 11 до 33.

for (let i = 11; i <= 33; i++) {
  console.log(i);
}

// Задача 3
// С помощью цикла for выведите в консоль четные числа в промежутке от 0 до 100.

for (let i = -1; i <= 100; i+=2) {
  console.log(i + 1);
}
// Еще вариант:
for (let i = 0; i <= 100; i++) {
  if (i % 2 === 0) console.log(i);
}

// Задача 4
// С помощью цикла for выведите в консоль нечетные числа в промежутке от 1 до 99.

for (let i = 1; i <= 99; i+=2) {
  console.log(i);
}

// Задача 5
// С помощью цикла for выведите в консоль числа от 100 до 0.

for (let i = 100; i >= 0; i--) {
  console.log(i);
}
