// Задача 1
// Если переменная test равна true, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = true;
if (test === true) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 2
// Если переменная test равна false, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = false;
if (test === false) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 3
// Не запуская код, определите, что выведется на экран:

let test = 1;

if (test == true) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 4
// Не запуская код, определите, что выведется на экран:

let test = 0;

if (test == true) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 5
// Не запуская код, определите, что выведется на экран:

let test = 1;

if (test == false) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 6
// Не запуская код, определите, что выведется на экран:

let test = 1;

if (test != true) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 7
// Не запуская код, определите, что выведется на экран:

let test = NaN;

if (test == true) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 8
// Не запуская код, определите, что выведется на экран:

let test = NaN;

if (test == false) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 9
// Не запуская код, определите, что выведется на экран:

let test = '';

if (test == false) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 10
// Не запуская код, определите, что выведется на экран:

let test;

if (test == true) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 11
// Не запуская код, определите, что выведется на экран:

let test = 3 * 'a';

if (test == true) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 12
// Перепишите следующий код с использованием сокращенного сравнения:

let test = true;

if (test == true) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 13
// Перепишите следующий код с использованием сокращенного сравнения:

let test = true;

if (test == false) { // if (!test)
	alert('верно');
} else {
	alert('неверно');
}


// Задача 14
// Перепишите следующий код с использованием сокращенного сравнения:

let test = true;

if (test != true) { // if (!test)
	alert('верно');
} else {
	alert('неверно');
}

// Задача 15
// Перепишите следующий код с использованием сокращенного сравнения:

let test = true;

if (test != false) { // if (test)
	alert('верно');
} else {
	alert('неверно');
}

// Задача 16
// Не запуская код, определите, что выведется на экран:

let test = 3;

if (test) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 17
// Не запуская код, определите, что выведется на экран:

let test = 'abc';

if (test) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 18
// Не запуская код, определите, что выведется на экран:

let test = '';

if (test) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 19
// Не запуская код, определите, что выведется на экран:

let test = 3 * 'abc';

if (test) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 20
// Не запуская код, определите, что выведется на экран:

let test = null;

if (test) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 21
// Не запуская код, определите, что выведется на экран:

let test = false;

if (test) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 22
// Не запуская код, определите, что выведется на экран:

let test;

if (test) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 23
// Не запуская код, определите, что выведется на экран:

let test = 0;

if (test) {
	alert('верно');
} else {
	alert('неверно'); // выведен будет результат
}

// Задача 24
// Не запуская код, определите, что выведется на экран:

let test = '0';

if (test) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}

// Задача 25
// Не запуская код, определите, что выведется на экран:

let test = -1;

if (test) {
	alert('верно'); // выведен будет результат
} else {
	alert('неверно');
}
