// Задача 1
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

let arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];
  for (let k = 1; k <= 5; k++) {
    arr[i].push(k);
  }
}

console.log(arr);

// Задача 2
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x']]

let arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];
  for (let k = 1; k <= 4; k++) {
    arr[i].push('x');
  }
}

console.log(arr);

// Задача 3
// Сформируйте с помощью трех вложенных циклов следующий массив:

// [
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// ]

let arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];
  for (let k = 0; k < 2; k++) {
    arr[i][k] = [];
    for (let j = 1; j <= 5; j++) {
      arr[i][k].push(j);
    }
  }
}

console.log(arr);

// Задача 4
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];
	for (let j = 1; j <= 5; j++) {
		arr[i].push(j);
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 5
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 1; j <= 5; j++) {
		arr[i].push(j);
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 6
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 1; j <= 5; j++) {
		arr[i].push(j);
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 7
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 1; j <= 5; j++) {
		arr[i].push(j);
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 8
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 0; j <= 5; j++) {
		arr[i][j] = j + 1;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 9
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 1; j <= 5; j++) {
		arr[i].push(j);
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 10
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 1; j <= 5; j++) {
		arr[i].push(j);
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 11
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 0; j <= 5; j++) {
		arr[i][j] = j;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 12
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 1; j <= 5; j++) {
		arr[i].push(j);
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 13
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 0; j <= 5; j++) {
		arr[i][j] = j;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 14
// Автор следующего кода хотел сделать двухмерный массив:

let arr = [];

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 0; j <= 5; j++) {
		arr[i][j] = j;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 15
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [[1, 2], [3, 4], [5, 6], [7, 8]]

let arr = [];

for (let i = 0, k = 1; i < 4; i++) {
	arr[i] = [];
	for (let j = 0; j < 2; j++) {
		arr[i][j] = k++;
	}
}

console.log(arr);

// Задача 16
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [[2, 4, 6], [8, 10, 12], [14, 16, 18], [20, 22, 24]]

let arr = [];

for (let i = 0, k = 0; i < 4; i++) {
	arr[i] = [];
	for (let j = 0; j < 3; j++) {
		arr[i][j] = (k = k + 2);
	}
}

console.log(arr);

// Задача 17
// Сформируйте с помощью трех вложенных циклов следующий трехмерный массив:
// [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]

let arr = [];

for (let i = 0, k = 1; i < 1; i++) {
	arr[i] = [];
	for (let j = 0; j < 4; j++) {
    arr[i][j] = [];
    for (let n = 0; n < 2; n++) {
      arr[i][j][n] = k++;
    }
	}
}

console.log(arr);

// Задача 18
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];

for (let i = 0, k = 1; i < 3; i++) {
	arr[i] = [];
	for (let j = 0; j < 3; j++) {
		arr[i][j] = k++;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 19
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];
let k = 1;

for (let i = 0; i < 3; i++) {
	arr[i] = [];
	for (let j = 0; j < 3; j++) {
		arr[i][j] = k++;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 20
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];
let k = 1;

for (let i = 0; i < 3; i++) {
	arr[i] = [];
	for (let j = 0; j < 3; j++) {
		arr[i][j] = k++;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 21
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];
let k = 1;

for (let i = 0; i < 3; i++) {
	arr[i] = [];
	for (let j = 0; j < 3; j++) {
		arr[i][j] = k++;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 22
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];

for (let i = 0, k = 1; i < 3; i++) {
	arr[i] = [];
	for (let j = 0; j < 3; j++) {
		arr[i][j] = k++;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 23
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];

for (let i = 0, k = 1; i < 3; i++) {
	arr[i] = [];
	for (let j = 0; j < 3; j++) {
		arr[i][j] = k++;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 24
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];

for (let i = 0, k = 1; i < 3; i++) {
	arr[i] = [];
	for (let j = 0; j < 3; j++, k++) {
		arr[i][j] = k;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 25
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];

for (let i = 0, k = 0; i < 3; i++) { // Можно счетчик начать с 0 и во втором цикле оставить
	arr[i] = [];                         //

	for (let j = 0; j < 3; j++) { //
		arr[i][j] = ++k; // здесь сначала увеличиваем
	}                   // Или в вехнем цикле счетчик оставляем 1 и во втором цикле делаем k++
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 26
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];
let k = 1;

for (let i = 0; i < 3; i++) {
	arr[i] = [];

	for (let j = 0; j < 3; j++) {
		arr[i][j] = k;
		k++;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Задача 27
// Автор следующего кода хотел сделать массив [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:

let arr = [];

for (let i = 0, k = 1; i < 3; i++) {
	arr[i] = [];

	for (let j = 0; j < 3; j++, k++) {
		arr[i][j] = k;
	}
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.
