// Задача 1
// Не запуская код, определите, что выведется на экран:

alert(true + 3); // 4

// Задача 2
// Не запуская код, определите, что выведется на экран:

alert(true + true); // 2

// Задача 3
// Не запуская код, определите, что выведется на экран:

alert(true - true); // 0

// Задача 4
// Не запуская код, определите, что выведется на экран:

alert(true + false); // 1

// Задача 5
// Не запуская код, определите, что выведется на экран:

alert('1' + true); // '1true'

// Задача 6
// Не запуская код, определите, что выведется на экран:

alert( String(true) + 1 ); // 'true1'

// Задача 7
// Не запуская код, определите, что выведется на экран:

alert(String(true) + Number(true)); // 'true1'
